dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxSdmmc_bf.h
/**
 * \file IfxSdmmc_bf.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37xED_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Sdmmc_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Sdmmc_Registers
 * 
 */
#ifndef IFXSDMMC_BF_H
#define IFXSDMMC_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Sdmmc_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_SDMMC_SDMASA_Bits.BLOCKCNT_SDMASA */
#define IFX_SDMMC_SDMASA_BLOCKCNT_SDMASA_LEN (32u)

/** \brief Mask for Ifx_SDMMC_SDMASA_Bits.BLOCKCNT_SDMASA */
#define IFX_SDMMC_SDMASA_BLOCKCNT_SDMASA_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_SDMASA_Bits.BLOCKCNT_SDMASA */
#define IFX_SDMMC_SDMASA_BLOCKCNT_SDMASA_OFF (0u)

/** \brief Length for Ifx_SDMMC_BLOCKSIZE_Bits.XFER_BLOCK_SIZE */
#define IFX_SDMMC_BLOCKSIZE_XFER_BLOCK_SIZE_LEN (12u)

/** \brief Mask for Ifx_SDMMC_BLOCKSIZE_Bits.XFER_BLOCK_SIZE */
#define IFX_SDMMC_BLOCKSIZE_XFER_BLOCK_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_SDMMC_BLOCKSIZE_Bits.XFER_BLOCK_SIZE */
#define IFX_SDMMC_BLOCKSIZE_XFER_BLOCK_SIZE_OFF (0u)

/** \brief Length for Ifx_SDMMC_BLOCKSIZE_Bits.SDMA_BUF_BDARY */
#define IFX_SDMMC_BLOCKSIZE_SDMA_BUF_BDARY_LEN (3u)

/** \brief Mask for Ifx_SDMMC_BLOCKSIZE_Bits.SDMA_BUF_BDARY */
#define IFX_SDMMC_BLOCKSIZE_SDMA_BUF_BDARY_MSK (0x7u)

/** \brief Offset for Ifx_SDMMC_BLOCKSIZE_Bits.SDMA_BUF_BDARY */
#define IFX_SDMMC_BLOCKSIZE_SDMA_BUF_BDARY_OFF (12u)

/** \brief Length for Ifx_SDMMC_BLOCKCOUNT_Bits.BLOCK_CNT */
#define IFX_SDMMC_BLOCKCOUNT_BLOCK_CNT_LEN (16u)

/** \brief Mask for Ifx_SDMMC_BLOCKCOUNT_Bits.BLOCK_CNT */
#define IFX_SDMMC_BLOCKCOUNT_BLOCK_CNT_MSK (0xffffu)

/** \brief Offset for Ifx_SDMMC_BLOCKCOUNT_Bits.BLOCK_CNT */
#define IFX_SDMMC_BLOCKCOUNT_BLOCK_CNT_OFF (0u)

/** \brief Length for Ifx_SDMMC_ARGUMENT_Bits.ARGUMENT */
#define IFX_SDMMC_ARGUMENT_ARGUMENT_LEN (32u)

/** \brief Mask for Ifx_SDMMC_ARGUMENT_Bits.ARGUMENT */
#define IFX_SDMMC_ARGUMENT_ARGUMENT_MSK (0xffffffffu)

/** \brief Offset for Ifx_SDMMC_ARGUMENT_Bits.ARGUMENT */
#define IFX_SDMMC_ARGUMENT_ARGUMENT_OFF (0u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.DMA_ENABLE */
#define IFX_SDMMC_XFER_MODE_DMA_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.DMA_ENABLE */
#define IFX_SDMMC_XFER_MODE_DMA_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.DMA_ENABLE */
#define IFX_SDMMC_XFER_MODE_DMA_ENABLE_OFF (0u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.BLOCK_COUNT_ENABLE */
#define IFX_SDMMC_XFER_MODE_BLOCK_COUNT_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.BLOCK_COUNT_ENABLE */
#define IFX_SDMMC_XFER_MODE_BLOCK_COUNT_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.BLOCK_COUNT_ENABLE */
#define IFX_SDMMC_XFER_MODE_BLOCK_COUNT_ENABLE_OFF (1u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.AUTO_CMD_ENABLE */
#define IFX_SDMMC_XFER_MODE_AUTO_CMD_ENABLE_LEN (2u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.AUTO_CMD_ENABLE */
#define IFX_SDMMC_XFER_MODE_AUTO_CMD_ENABLE_MSK (0x3u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.AUTO_CMD_ENABLE */
#define IFX_SDMMC_XFER_MODE_AUTO_CMD_ENABLE_OFF (2u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.DATA_XFER_DIR */
#define IFX_SDMMC_XFER_MODE_DATA_XFER_DIR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.DATA_XFER_DIR */
#define IFX_SDMMC_XFER_MODE_DATA_XFER_DIR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.DATA_XFER_DIR */
#define IFX_SDMMC_XFER_MODE_DATA_XFER_DIR_OFF (4u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.MULTI_BLK_SEL */
#define IFX_SDMMC_XFER_MODE_MULTI_BLK_SEL_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.MULTI_BLK_SEL */
#define IFX_SDMMC_XFER_MODE_MULTI_BLK_SEL_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.MULTI_BLK_SEL */
#define IFX_SDMMC_XFER_MODE_MULTI_BLK_SEL_OFF (5u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.RESP_TYPE */
#define IFX_SDMMC_XFER_MODE_RESP_TYPE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.RESP_TYPE */
#define IFX_SDMMC_XFER_MODE_RESP_TYPE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.RESP_TYPE */
#define IFX_SDMMC_XFER_MODE_RESP_TYPE_OFF (6u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.RESP_ERR_CHK_ENABLE */
#define IFX_SDMMC_XFER_MODE_RESP_ERR_CHK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_SDMMC_XFER_MODE_Bits.RESP_ERR_CHK_ENABLE */
#define IFX_SDMMC_XFER_MODE_RESP_ERR_CHK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_XFER_MODE_Bits.RESP_ERR_CHK_ENABLE */
#define IFX_SDMMC_XFER_MODE_RESP_ERR_CHK_ENABLE_OFF (7u)

/** \brief Length for Ifx_SDMMC_XFER_MODE_Bits.RESP_INT_DISABLE */
#define IFX_SDMMC_XFER_MODE_RESP_INT_DISABLE_LEN (1u)

