dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxSdmmc_bf.h
/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.FX_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_FX_EVENT_OFF (13u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CQE_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_CQE_EVENT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CQE_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_CQE_EVENT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.CQE_EVENT */
#define IFX_SDMMC_NORMAL_INT_STAT_CQE_EVENT_OFF (14u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_Bits.ERR_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_ERR_INTERRUPT_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_Bits.ERR_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_ERR_INTERRUPT_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_Bits.ERR_INTERRUPT */
#define IFX_SDMMC_NORMAL_INT_STAT_ERR_INTERRUPT_OFF (15u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_TOUT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_TOUT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_TOUT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_TOUT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_TOUT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_TOUT_ERR_OFF (0u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_CRC_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_CRC_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_CRC_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_CRC_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_CRC_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_CRC_ERR_OFF (1u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_END_BIT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_END_BIT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_END_BIT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_END_BIT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_END_BIT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_END_BIT_ERR_OFF (2u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_IDX_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_IDX_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_IDX_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_IDX_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.CMD_IDX_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CMD_IDX_ERR_OFF (3u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_TOUT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_TOUT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_TOUT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_TOUT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_TOUT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_TOUT_ERR_OFF (4u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_CRC_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_CRC_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_CRC_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_CRC_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_CRC_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_CRC_ERR_OFF (5u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_END_BIT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_END_BIT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_END_BIT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_END_BIT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.DATA_END_BIT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_DATA_END_BIT_ERR_OFF (6u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.CUR_LMT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CUR_LMT_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.CUR_LMT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CUR_LMT_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.CUR_LMT_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_CUR_LMT_ERR_OFF (7u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.AUTO_CMD_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_AUTO_CMD_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.AUTO_CMD_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_AUTO_CMD_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.AUTO_CMD_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_AUTO_CMD_ERR_OFF (8u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.ADMA_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_ADMA_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.ADMA_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_ADMA_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.ADMA_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_ADMA_ERR_OFF (9u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.TUNING_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_TUNING_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.TUNING_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_TUNING_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.TUNING_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_TUNING_ERR_OFF (10u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.RESP_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_RESP_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.RESP_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_RESP_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.RESP_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_RESP_ERR_OFF (11u)

/** \brief Length for Ifx_SDMMC_ERROR_INT_STAT_Bits.BOOT_ACK_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_BOOT_ACK_ERR_LEN (1u)

/** \brief Mask for Ifx_SDMMC_ERROR_INT_STAT_Bits.BOOT_ACK_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_BOOT_ACK_ERR_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_ERROR_INT_STAT_Bits.BOOT_ACK_ERR */
#define IFX_SDMMC_ERROR_INT_STAT_BOOT_ACK_ERR_OFF (12u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CMD_COMPLETE_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CMD_COMPLETE_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CMD_COMPLETE_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CMD_COMPLETE_STAT_EN_MSK (0x1u)

/** \brief Offset for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.CMD_COMPLETE_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_CMD_COMPLETE_STAT_EN_OFF (0u)

/** \brief Length for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.XFER_COMPLETE_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_XFER_COMPLETE_STAT_EN_LEN (1u)

/** \brief Mask for Ifx_SDMMC_NORMAL_INT_STAT_EN_Bits.XFER_COMPLETE_STAT_EN */
#define IFX_SDMMC_NORMAL_INT_STAT_EN_XFER_COMPLETE_STAT_EN_MSK (0x1u)

